src/cf/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикСтраховыхВзносовПФР_ФФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИПТарифыФиксированныхВзносов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ИПТарифыФиксированныхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИПТарифыФиксированныхВзносов</Name>
			<Comment>Тарифы фиксированных взносов ИП согласно ст. 430 НК РФ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единый</Name>
					<Comment>Единый тариф согласно п.1.2 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйПенсионер</Name>
					<Comment>Тариф для военных пенсионеров согласно п.1.4. ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСЭЗнаНТ</Name>
					<Comment>Тариф для участника СЭЗ в соответствии с п.1.3 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйПенсионерСЭЗ</Name>
					<Comment>Тариф для военных пенсионеров согласно п.1.4. ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения = Неопределено Или ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ПараметрыНастроек = ?(ДанныеЗаполнения = Неопределено, Новый Структура, ДанныеЗаполнения);
		Для каждого Запись Из ЭтотОбъект Цикл
			РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.УстановкаНастроекПоУмолчанию(
				Запись, ПараметрыНастроек);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если ТекущаяЗапись.Тариф = Перечисления.ИПТарифыФиксированныхВзносов.УчастникСЭЗнаНТ
			И Не УчетСтраховыхВзносовИПКлиентСервер.ПрименяетсяТарифУчастникСЭЗ(ТекущаяЗапись.Период) Тогда
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'С 2026 г. для участников СЭЗ пониженный тариф не действует. Выберите другой тариф для %1.'"),
				ТекущаяЗапись.Организация);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	КонецЦикла;
	
	НастройкиУчета.ПередЗаписью(ЭтотОбъект, Отказ, Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиУчета.ПриЗаписи(ЭтотОбъект, Отказ, Замещение);
	
	НеобходимоСоздатьВидыНалогов = Ложь;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ПлательщикСтраховыхВзносовПФР_ФФОМС И УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоход(
			Запись.Организация, Запись.Период) Тогда
			НеобходимоСоздатьВидыНалогов = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НеобходимоСоздатьВидыНалогов Тогда
		Справочники.ВидыНалоговИПлатежейВБюджет.СоздатьПоставляемыеЭлементы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
